In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    'first': ['Ravi', 'sonu', 'John', 'Shivam', np.nan, None, 'NA'], 
    'last': ['Singh', 'kumar', 'kumar', 'singh', np.nan, np.nan, 'Missing'], 
    'email': [' ravi@gmail.com', 'sonu@email.com', 'johan@email.com', None, np.nan, 'As@email.com', 'NA'],
    'age': ['21', '20', '16', '30', None, None, 'Missing']
}

In [3]:
df = pd.DataFrame(people)

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)

In [4]:
df

    first   last            email   age
0    Ravi  Singh   ravi@gmail.com    21
1    sonu  kumar   sonu@email.com    20
2    John  kumar  johan@email.com    16
3  Shivam  singh             None    30
4     NaN    NaN              NaN  None
5    None    NaN     As@email.com  None
6     NaN    NaN              NaN   NaN

In [5]:
df.dropna()

  first   last            email age
0  Ravi  Singh   ravi@gmail.com  21
1  sonu  kumar   sonu@email.com  20
2  John  kumar  johan@email.com  16

In [6]:
df.dropna(axis='index', how='all', subset=['last', 'email'])

    first   last            email   age
0    Ravi  Singh   ravi@gmail.com    21
1    sonu  kumar   sonu@email.com    20
2    John  kumar  johan@email.com    16
3  Shivam  singh             None    30
5    None    NaN     As@email.com  None

In [7]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [10]:
df.fillna(1)

    first   last            email age
0    Ravi  Singh   ravi@gmail.com  21
1    sonu  kumar   sonu@email.com  20
2    John  kumar  johan@email.com  16
3  Shivam  singh                1  30
4       1      1                1   1
5       1      1     As@email.com   1
6       1      1                1   1

In [11]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [12]:
df['age'].mean

<bound method Series.mean of 0      21
1      20
2      16
3      30
4    None
5    None
6     NaN
Name: age, dtype: object>

In [13]:
df['age'] = df['age'].astype(float)

In [14]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [15]:
df['age'].mean()

21.75